BUTTON_INFO = {
    "гайд по вышке": (
        "Этот гайд введет вас в учебеную жизнь и немного "
        "расскажет о вышке в целом:\n ⬇️⬇️⬇️ \n"
        "https://hsefirsttime.notion.site/a7d19f352a604bcd8d57c8f0816fc28e?v="
        "03f6aadb0adf4054a40b2f1ae3eebd8f"
    ),
    "академический отпуск": (
        "<b>-Основания и порядок предоставления академического отпуска. "
        "Допуск к занятиям после выхода из академического отпуска\n\n"
        "-Кто принимает решение о предоставлении академического отпуска?\n\n"
        "-Могут ли мне отказать в предоставлении академического отпуска?\n\n"
        "-Включается ли период нахождения в академическом отпуске в срок "
        "освоения образовательной программы?\n\n"
        "-На каких основаниях может быть предоставлен "
        "академический отпуск?\n\n"
        "-Как получить академический отпуск в целях создания "
        "университетского стартапа?\n\n"
        "-Могу ли я взять академический отпуск с целью обучения "
        "в иностранном университете?\n\n"
        "-Каков порядок действий при выходе из академического отпуска?\n\n"
        "-Сохраняется ли бюджетное место за студентом, "
        "обучавшимся на бюджете?</b>\n\n"
        "Все это вы можете узнать здесь:\n ⬇️⬇️⬇️ \n"
        "https://www.hse.ru/studyspravka/academotpusk/"
    ),
    "отчисление": (
        "<b>-В каких случаях студент может быть отчислен "
        "из Высшей школы экономики?\n\n"
        "-Что такое добросовестное освоение образовательной программы?\n\n"
        "-Может ли студент быть отчислен во время болезни, "
        "академического отпуска, отпуска по беременности и родам, "
        "отпуска по уходу за ребёнком до достижения им возраста 3-х лет?\n\n"
        "-Документы</b>\n\n"
        "Вся информация доступна здесь:\n ⬇️⬇️⬇️ \n"
        "https://www.hse.ru/studyspravka/otch/"
    ),
}

NAME_USERNAME = {
    "учебный офис": {
        "<b>Нестерова Татьяна Валерьевна</b>: ": "@Tatyana_Nesterowa, ",
        "<b>Звидрина Анна Михайловна</b>: ": "@anzvi",
        "<b>Ксения Алексеевна</b>: ": "@ksuumii",
        "<b>Харькова Анастасия Вадимовна</b>: ": "@aakharkovaa",
    },
    "руководители": {
        "<b>Антон Кузнецов - Замдекана</b>: ": "@kuzik566",
        "<b>Кольцов Сергей Николаевич - Академ. руководитель ПАДИИ</b>: ": (
            "https://vk.com/kolsergei"
        ),
        "<b>Храбров Александр Игоревич - Академ. руководитель ПМИ</b>: ": (
            "aikhrabrov@mail.ru"
        ),
        "<b>Мухин Михаил Сергеевич - Декан</b>: ": "@MikeMukhin",
    },
    "учителя": {
        "<b>Тут есть все учителя и их контакты</b>: ": (
            "https://spb.hse.ru/ba/dataanalytics/tutors"
        )
    },
}

TEXT_FOR_HELP_COMMAND = (
    "Возможности и правила пользования ботом, рекомендации:\r\n\r\n "
    "1. Для того, чтобы задать вопрос, "
    "отправляемое вами сообщение должно содержать знак вопроса('?').\r\n\r\n "
    "2. Если вы задаете вопрос боту, прописывайте ваш вопрос полностью "
    "в одном сообщении. "
    "Не нужно разделять вопрос на несколько сообщений.\r\n\r\n"
    "3. Если вы задаете вопрос боту, "
    "то шанс получить ответ на этот вопрос быстрее возрастает. "
    "Поскольку этот вопрос получат сразу все сотрудники "
    "учебного офиса.\r\n\r\n"
    "4. Если вы не удовлетворены ответом бота и переходите в "
    "'режим диалога' с админом, то все кнопки бота не будут работать. "
    "Это будет происходить до того момента, пока вы не выйдите из диалога, "
    "нажав 'Я удовлетворен ответом'.\r\n\r\n"
    "5. Не стоит спрашивать у бота вопросы, имеющие срок актуальности.\r\n\r\n"
    "6. При спаме в бота пользователю может быть выдан мут.\r\n\r\n"
    "7. Бот делает автоматическую рассылку при изменении в расписании, "
    "а также при готовности справок. "
    "Для того, чтобы получать автоматическую рассылку готовности справок "
    "напишите комманду /full_name_for_certificate "
    "и напишите свое ФИО, которое вы указываете при заказе справки.\r\n\r\n"
)

CERTIFICATE_TEXT = (
    "<b>Форма для заказа справки:</b> "
    "https://docs.google.com/forms/d/e/1FAIpQLSclDRuIbyta1uULLTpUqSk9UKOxEhxhF"
    "fs-MrAlW7_lqBPbhw/viewform \r\n\r\n"
    "<b>Таблица готовности справок:</b> "
    "https://docs.google.com/spreadsheets/d/1VrUvZRE2YcPiIPFfdi1mqwE7QDO30Y8NS"
    "dzxUBPQVOQ/edit?usp=sharing \r\n\r\n"
    "<b>Ссылки на справки бухгалтерии и военкомата на сайте:</b> "
    "https://spb.hse.ru/ba/dataanalytics/reference"
)
