BUTTON_INFO = {
    "гайд по вышке" : f"Этот гайд введет вас в учебеную жизнь и немного расскажет о вышке в целом:\n ⬇️⬇️⬇️ \n"
                      f"https://hsefirsttime.notion.site/a7d19f352a604bcd8d57c8f0816fc28e?v=03f6aadb0adf4054a40b2f1ae3eebd8f",
    "академический отпуск" : f"<b>-Основания и порядок предоставления академического отпуска. Допуск к занятиям после выхода из академического отпуска\n\n"
                             f"-Кто принимает решение о предоставлении академического отпуска?\n\n"
                             f"-Могут ли мне отказать в предоставлении академического отпуска?\n\n"
                             f"-Включается ли период нахождения в академическом отпуске в срок освоения образовательной программы?\n\n"
                             f"-На каких основаниях может быть предоставлен академический отпуск?\n\n"
                             f"-Как получить академический отпуск в целях создания университетского стартапа?\n\n"
                             f"-Могу ли я взять академический отпуск с целью обучения в иностранном университете?\n\n"
                             f"-Каков порядок действий при выходе из академического отпуска?\n\n"
                             f"-Сохраняется ли бюджетное место за студентом, обучавшимся на бюджете?</b>\n\n"
                             f"Все это вы можете узнать здесь:\n ⬇️⬇️⬇️ \n"
                             f"https://www.hse.ru/studyspravka/academotpusk/",
    "отчисление" : f"<b>-В каких случаях студент может быть отчислен из Высшей школы экономики?\n\n"
                   f"-Что такое добросовестное освоение образовательной программы?\n\n"
                   f"-Может ли студент быть отчислен во время болезни, академического отпуска, отпуска по беременности и родам, "
                   f"отпуска по уходу за ребёнком до достижения им возраста 3-х лет?\n\n"
                   f"-Документы</b>\n\n"
                   f"Вся информация доступна здесь:\n ⬇️⬇️⬇️ \n"
                   f"https://www.hse.ru/studyspravka/otch/"
}

NAME_USERNAME = { 
    "учебный офис": {
        "<b>Нестерова Татьяна Валерьевна</b>: " : "@Tatyana_Nesterowa, ",
        "<b>Звидрина Анна Михайловна</b>: " : "@anzvi",
        "<b>Ксения Алексеевна</b>: " : "@ksuumii",
        "<b>Харькова Анастасия Вадимовна</b>: " : "@aakharkovaa",
    },
    "руководители": {
        "<b>Антон Кузнецов - Замдекана</b>: " : "@kuzik566",
        "<b>Кольцов Сергей Николаевич - Академический руководитель ПАДИИ</b>: " : "https://vk.com/kolsergei",
        "<b>Храбров Александр Игоревич - Академический руководитель ПМИ</b>: " : "aikhrabrov@mail.ru",
        "<b>Мухин Михаил Сергеевич - Декан</b>: " : "@MikeMukhin",
    },
    "учителя": {
        "<b>Тут есть все учителя и их контакты</b>: " : "https://spb.hse.ru/ba/dataanalytics/tutors"
    }
}

TEXT_FOR_HELP_COMMAND = (f"Правила пользования ботом и рекомендации:\r\n\r\n 1. Для того, чтобы задать вопрос, "
                         f"отправляемое вами сообщение должно содержать знак вопроса('?').\r\n\r\n "
                         f"2. Если вы задаете вопрос боту, прописывайте ваш вопрос полностью в одном сообщении. "
                         f"Не нужно разделять вопрос на несколько сообщений."
                         f"3. Если вы задаете вопрос боту, то шанс получить ответ на этот вопрос быстрее возрастает. "
                         f"Поскольку этот вопрос получат сразу все сотрудники учебного офиса"
                         f"4. При спаме в бота пользователю может быть выдан мут.")
